In [48]:
import pandas as pd
import numpy as np

1. Define and create a Dataframe using Pandas.

In [33]:
#DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet.

data = [['tom', 10], ['nick', 15], ['juli', 14]] 
df = pd.DataFrame(data, columns = ['Name', 'Age']) 
  
# print dataframe. 
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

2. How can we calculate the standard deviation from the series.

In [11]:
sr = pd.Series([10,20,30,40,50])
print(sr)
print("Standard Deviation: ",sr.std())

0    10
1    20
2    30
3    40
4    50
dtype: int64
Standard Deviation:  15.811388300841896

3. Create a Dataframe using List given below:
lis=[‘Python’,’Numpy’,’Pandas’]

In [17]:
lis=['Python','Numpy','Pandas']
df = pd.DataFrame(lis)
df

        0
0  Python
1   Numpy
2  Pandas

4. Create a Series from dictionary given below:

info = {'x' : 0., 'y' : 1., 'z' : 2.}

In [18]:
info = {'x' : 0., 'y' : 1., 'z' : 2.}
ds = pd.Series(info)
ds

x    0.0
y    1.0
z    2.0
dtype: float64

5. How will you create an empty Dataframe in Pandas?

In [23]:
emp_df = pd.DataFrame()
print(emp_df)

Empty DataFrame
Columns: []
Index: []

6. i) Add a column to that pandas Dataframe that you created in Q1

ii) Change index of that Dataframe.

In [34]:
df.insert(2,'Std',[7,12,11])
print(df)

   Name  Age  Std
0   tom   10    7
1  nick   15   12
2  juli   14   11

In [35]:
# after indexing
df.set_index("Name",inplace = True)
print(df)

      Age  Std
Name
tom    10    7
nick   15   12
juli   14   11

7. Get the following from this dataframe:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df = pd.DataFrame({ 'field_A': A, 'field_B': B })

i) mean

ii) median

iii) mode

iv) 75th percentile

v) 90th percentile

vi) 99th percentile

In [46]:
import random
A = [ random.randint(0,100) for i in range(10) ]
B = [ random.randint(0,100) for i in range(10) ]
df1 = pd.DataFrame({ 'field_A': A, 'field_B': B })
print(df1)
print("---")
print("Mean:","\n",df1.mean())
print("---")
print("Median:","\n",df1.median())
print("---")
print("Mode:","\n",df1.mode())
print("---")
print("75th Percentile:","\n",df1.quantile(0.75))
print("---")
print("90th Percentile:","\n",df1.quantile(0.90))
print("---")
print("99th Percentile:","\n",df1.quantile(0.99))

   field_A  field_B
0       21       97
1       51       29
2       78       11
3       68       37
4       20       52
5       28       95
6       88       84
7       89        9
8       59       16
9       40       88
---
Mean:
 field_A    54.2
field_B    51.8
dtype: float64
---
Median:
 field_A    55.0
field_B    44.5
dtype: float64
---
Mode:
    field_A  field_B
0       20        9
1       21       11
2       28       16
3       40       29
4       51       37
5       59       52
6       68       84
7       78       88
8       88       95
9       89       97
---
75th Percentile:
 field_A    75.5
field_B    87.0
Name: 0.75, dtype: float64
---
90th Percentile:
 field_A    88.1
field_B    95.2
Name: 0.9, dtype: float64
---
99th Percentile:
 field_A    88.91
field_B    96.82
Name: 0.99, dtype: float64

8. How do you count how many unique rows a DataFrame has (i.e.
ignore all rows that are duplicates)?

In [ ]:
using .value_count()
#value count first finds unique departments a
#it then counts n(rows) in that dept

9. How to keep only top 2 most frequent values as it is and replace
everything else as ‘Other’? Take the following as input.
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [85]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
print(ser)
print("Top 2 freq values: \n",ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:1])]='Others'
print(ser)

0     4
1     2
2     4
3     3
4     2
5     4
6     4
7     2
8     4
9     4
10    4
11    4
dtype: int64
Top 2 freq values:
 4    8
2    3
3    1
dtype: int64
0          4
1     Others
2          4
3     Others
4     Others
5          4
6          4
7     Others
8          4
9          4
10         4
11         4
dtype: object

10. A DataFrame has a column of groups 'grps' and and column of
integer values 'vals':

df = pd.DataFrame({'grps':
list('aaabbcaabcccbbc'),
'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235,
21, 57, 3, 87]})

For each group, find the sum of the three greatest values. You
should end up with the answer as follows:
grps
a 409
b 156
c 345

*Create a dataframe for the following to answer the next few questions
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat',
'snake', 'cat', 'dog', 'dog'],
'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no',
'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [97]:
df = pd.DataFrame({'grps':list('aaabbcaabcccbbc'),
'vals': [12, 345, 3, 1, 45, 14 , 4, 52, 54, 23, 235, 21, 57, 3, 87]})
print(df)

print(df.groupby('grps')['vals'].nlargest(3).sum(level=0))

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87
grps
a    409
b    156
c    345
Name: vals, dtype: int64

In [144]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'], 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df_vet = pd.DataFrame(data,index=labels)
df_vet

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

11. Display a summary of the basic information about this
DataFrame and its data (hint: there is a single method that can
be called on the DataFrame).

In [113]:
df_vet.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

12. Select the rows where the age is between 2 and 4 (inclusive).

In [122]:
df_vet[df_vet['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

13. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [123]:
df_vet.loc[df_vet.index[[3,4,8]],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

14. Select the rows where the age is missing, i.e. it is NaN.

In [126]:
df_vet[df_vet['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

15. Select the rows where the animal is a cat and the age is less than 3.

In [129]:
df_vet[(df_vet['animal']=='cat') & (df_vet['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

16. Change the age in row 'f' to 1.5.

In [132]:
df_vet.loc['f','age'] = 1.5
df_vet['age']

a    2.5
b    3.0
c    0.5
d    NaN
e    5.0
f    1.5
g    4.5
h    NaN
i    7.0
j    3.0
Name: age, dtype: float64

17. In the 'animal' column, change the 'snake' entries to 'python'.

In [147]:
df_vet['animal'] = df_vet['animal'].replace("snake","Python")
df_vet['animal']

a       cat
b       cat
c    Python
d       dog
e       dog
f       cat
g    Python
h       cat
i       dog
j       dog
Name: animal, dtype: object

18. Count the number of each type of animal in df.

In [140]:
df_vet['animal'].value_counts()

cat       4
dog       4
Python    2
Name: animal, dtype: int64

19. The 'priority' column contains the values 'yes' and 'no'. Replace
this column with a column of boolean values: 'yes' should
be True and 'no' should be False.

In [145]:
r = {'yes':True,'no':False}
df_vet['priority']=df_vet['priority'].map(r)
df_vet['priority']

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

20. For each animal type and each number of visits, find the mean
age. In other words, each row is an animal, each column is a
number of visits and the values are the mean ages (hint: use a
pivot table).

In [149]:
df_vet.pivot_table(values = 'age', index='animal',columns='visits',aggfunc = "mean")

visits    1    2    3
animal
Python  4.5  0.5  NaN
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN